Revit 2027 API
RadialArray.GetMinimumSize Method
 Returns the minimum size for a radial array based on the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int GetMinimumSize(
	Document document
)
Public Shared Function GetMinimumSize (
	document As Document
) As Integer
public:
static int GetMinimumSize(
	Document^ document
)
static member GetMinimumSize :
        document : Document -> int
Parameters
document Document
 The document.
Return Value
Int32
 The minimum size of an array.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This value is 3 in projects and 0 in families.
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace